// pages/intro/intro.js
Page({

  /**
   * Page initial data
   */
  data: {
    text: "一、 成立与发展\n中国发明协会是在党和国家领导人、中科院院士及社会活动家等135人联合倡议下，经中央批准于1985年在北京成立的。参加联合倡议的有胡锦涛、倪志福、邹家华、王兆国、宋健、张劲夫、汪道涵等领导干部，有钱学森、黄家驷、金善宝、王大珩、严东生、张光斗、侯祥麟、沈鸿、武衡等当时的学部委员(现在的院士) ，还有王崇伦等发明家。倡议成立中国发明协会的根本出发点，是推动群众性的发明创造活动。聂荣臻同志在致协会成立大会的贺电中指出，中国发明协会的成立“是促进科技工作发展的又一条重要途径”。邓颖超同志为发明协会题写会名。李先念、姚依林、乌兰夫、方毅、陈慕华、王任重、胡乔木等党和国家领导人出席了协会的成立大会，接见了与会的发明者并与大家合影留念。方毅同志在成立大会上发表重要讲话。彭真、方毅、严济慈、张爱萍、宋健为协会题词。协会成立后聂荣臻同志任名誉会长，武衡同志为会长（一、二、三届），刘延东、聂力任副会长，倪志福同志为第四届全国理事会理事长。朱丽兰同志为五、六届理事长，王选、倪志福、聂力被推举为名誉理事长。2016年5 月 16 日, 中国发明协会第七次全国会员代表大会在北京人民大会堂召开，中共中央政治局常委、国务院总理李克强对大会召开和中国发明协会的工作作出重要批示。全国政协外事委员会主任、中国工程院原常务副院长潘云鹤院士当选中国发明协会第七届理事会理事长，余华荣当选常务副理事长兼秘书长，马云、王传福 、邹远东、徐士龙、刘彭芝(女) 、王锡娟（女）、房汉廷、闫楚良院士等52人当选为副理事长和常务理事，聘请“杂交水稻之父”袁隆平院士为中国发明协会顾问，王永民、包起帆、曹培生为名誉副理事长。\n    二、 宗旨\n贯彻大众创业、万众创新”方针，调动广大群众中蕴藏的发明创新创业积极性，引导和推动群众性发明创新创业活动，宣传普及发明创新创业知识，发现和支持发明创新创业人才，维护发明者的合法权益，促进发明成果转化实施，在密切发明者与政府的联系中发挥“纽带”、“桥梁”作用，推动创新驱动发展战略、军民融合发展战略、知识产权强国战略，不断增强全社会的创新活力，提高自主创新能力，为建设创新型国家，为实现两个“一百年”的奋斗目标，实现中华民族伟大复兴的中国梦而努力。中国发明协会在各项活动中，遵守我国宪法、法律、法规和国家政策，遵守社会道德风尚。\n    三、 会员\n中国发明协会会员分为单位会员和个人会员。目前，作为单位会员，省市自治区、计划单列市成立的发明协会及有关企、事业单位有200多个, 个人会员近4000人。\n    四、国际合作交流\n中国发明协会与世界知识产权组织（WIPO）、发明者协会国际联合会（IFIA）等国际组织一直保持着密切的联系，协会还是IFIA的正式会员。与美国、德国、法国、韩国、日本、马来西亚、菲律宾、匈牙利、波兰、摩洛哥等40多个国家的发明组织也保持着密切联系。上述国家和国际组织，对中国发明协会一直很友好，并且给予了比较高的评价。同时，协会与港澳台的发明组织的来往频繁，关系密切。\n    五、业务主管和挂靠单位\n国家科技部是业务主管单位，国家知识产权局为挂靠单位。日常工作包括思想政治工作、党团组织工作等归口国家知识产权局管理。"
  },

  /**
   * Lifecycle function--Called when page load
   */
  onLoad: function (options) {

  },

  /**
   * Lifecycle function--Called when page is initially rendered
   */
  onReady: function () {

  },

  /**
   * Lifecycle function--Called when page show
   */
  onShow: function () {

  },

  /**
   * Lifecycle function--Called when page hide
   */
  onHide: function () {

  },

  /**
   * Lifecycle function--Called when page unload
   */
  onUnload: function () {

  },

  /**
   * Page event handler function--Called when user drop down
   */
  onPullDownRefresh: function () {

  },

  /**
   * Called when page reach bottom
   */
  onReachBottom: function () {

  },

  /**
   * Called when user click on the top right corner to share
   */
  onShareAppMessage: function () {

  }
})